# 公众号配置
# 公众号appId
app_id = "wx87edf3f6e1025cf3"
# 公众号appSecret
app_secret = "ef42a1175e2497db06c4cb864efa06e6"
# 模板消息id
# 每日消息
template_id1 = "IM6gWRIF0KJ9tPLFqtps-bDfUYsV1J0SVAFNmpShE0k"
# 课程消息,上课提醒
template_id2 = "NXtQgXHRdI-io0odB2VTciuPmwWe0y-XUqSMwVuYuhA"
# 晚安心语
template_id3 = "NrST-uEBhIsYvHPnhajSgRdiyWwB848fhLRF5cjdgqM"
# 接收公众号消息的微信号
# 这是openid
user = ["oShA16fyWBIKDYPJxPKOQxA3Z1N4"]

# 信息配置
# 所在省份
province = "安徽"
# 所在城市
city = "合肥"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2002-7-1"
# 在一起的日子，格式同上------------计时器
love_date = "2022-7-21"
# 天行数据晚安心语 key
# good_Night_Key = "4082bfd944c******************"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2023
month = 9
day = 4
# 每日推送时间
post_Time = "07:00:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "09:40:00", "13:40:00", "15:40:00", "18:40:00"]
# 课程时间
course_Time = ["8:15--9:50", "10:05--11:40", "14:00--15:35"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:00:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "1": [
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "2":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "3":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "4":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "5":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['形势与政策5-8周葛琼C405', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "6":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['形势与政策5-8周葛琼C405', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "7":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['形势与政策5-8周葛琼C405', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "8":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['形势与政策5-8周葛琼C405', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "9":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "10":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "11":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "12":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "13":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['创新创业课 13-16周 魏一凡C102', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "14":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['创新创业课 13-16周 魏一凡C102', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "15":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['创新创业课 13-16周 魏一凡C102', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
        "16":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['创新创业课 13-16周 魏一凡C102', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "17":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "18":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "19":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
         "20":[
            ['', '学前教育史 史响 G605', '舞蹈剧目一组 郭纯 艺馨楼四楼舞蹈教室一'],
            ['钢琴与幼儿歌曲弹唱（上）一组 童宁 艺馨楼4楼钢琴教室3', '儿童美术基础与技能 隋金池 食堂四楼环创实训室 ', '毛中特概论 江艳C101'],
            ['', '学前儿童卫生与保健 陈晓菁 食堂四楼卫生与保健实训室 ', ''],
            ['声乐 童宁 东附楼308', '书写 张娟娟 东食堂四楼 书法教室', '舞蹈剧目 二组 郭纯 食堂舞一'],
            ['', '幼儿园课件制作 刘伟芹云机房(2)(东副楼114机房)75', '幼儿园综合教育活动设计与指导 陈晓娇C403'],
            ['', '', ''],
            ['', '', '']
        ],
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{love_day.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}
